Table of Contents
 Class MatPrestressSteelSIA
Namespace
IdeaRS.OpenModel.Material
Assembly
IdeaRS.OpenModel.dll
Material prestressing steel SIA
[OpenModelClass("CI.StructModel.Libraries.Material.SIA.MatPrestressSteelSIA,CI.Material", "CI.StructModel.Libraries.Material.IMatPrestressSteel,CI.BasicTypes", typeof(MatPrestressSteel))]
public class MatPrestressSteelSIA : MatPrestressSteel
Inheritance
object
OpenObject
OpenElementId
Material
MatPrestressSteel
MatPrestressSteelSIA
Inherited Members
 MatPrestressSteel.Diameter
 MatPrestressSteel.Area
 MatPrestressSteel.NumberOfWires
 MatPrestressSteel.EquivalentDiameter
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 MatPrestressSteelSIA()
Constructor
public MatPrestressSteelSIA()
Properties
 DiagramType
Type of diagram
public ReinfDiagramType DiagramType { get; set; }
Property Value
ReinfDiagramType
 Epsud
dimensioning value of ultimate strain of reinforcing steel or prestressing steel
public double Epsud { get; set; }
Property Value
double
 Epsuk
characteristic value of ultimate strain of reinforcing steel or strain at maximum load for prestressing steel
public double Epsuk { get; set; }
Property Value
double
 Fp01k
characteristic value of yield strength of prestressing steel
public double Fp01k { get; set; }
Property Value
double
 Fpd
dimensioning value of yield strength of prestressing steel
public double Fpd { get; set; }
Property Value
double
 Fpk
characteristic value of tensile strength of prestressing steel
public double Fpk { get; set; }
Property Value
double
 SurfaceCharacteristic
Surface characteristic
public SurfaceCharacteristicTypeSIA SurfaceCharacteristic { get; set; }
Property Value
SurfaceCharacteristicTypeSIA
 Type
Type of prestress steel
public PrestressSteelTypeSIA Type { get; set; }
Property Value
PrestressSteelTypeSIA
 Edit this page